000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗапросДоступностиТоваров/ЗапросДоступностиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросДоступностиТоваров</name>
  <registerRecords>InformationRegister.ИнформацияТТН</registerRecords>
  <registerRecords>AccumulationRegister.ТТН</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыПоЗаказамПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МагазинОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>МагазинПолучатель</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗапроса</name>
    <type>
      <types>EnumRef.СтатусыЗапросовДоступностиТоваровШапка</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставкиЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ТовароТранспортнаяНакладная</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаНаАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТребование</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗапроса</name>
      <type>
        <types>EnumRef.СтатусыЗапросовДоступностиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Ширина</name>
      <comment>Ширина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>Высота в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Глубина</name>
      <comment>Глубина в см.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <comment>Вес, кг</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричинаИзменений</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийПоСтрокам/КомментарийПоСтрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийПоСтрокам</name>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Просмотрен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВозвратИнтернетЗаказа</types>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваров/СтатусыЗапросовДоступностиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваров</name>
  <enumValues>
    <name>Подготовить</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗаказовПокупателей/СтатусыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателей</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДоступности</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/НазначенияСкладов/НазначенияСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияСкладов</name>
  <enumValues>
    <name>ТорговыйЗал</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>УправляющаяСистема</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипДоставкиЗаказПокупателя/ТипДоставкиЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДоставкиЗаказПокупателя</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>Смешаный</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусОплаты/СтатусОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОплаты</name>
  <enumValues>
    <name>НеОплачен</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ОтправленаСсылка</name>
  </enumValues>
  <enumValues>
    <name>Переплата</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОператорыДоставки/ОператорыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОператорыДоставки</name>
  <enumValues>
    <name>ВнутренняяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочта</name>
  </enumValues>
  <enumValues>
    <name>MeestExpress</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаКурьером</name>
  </enumValues>
  <enumValues>
    <name>МеждународнаяДоставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗапросДоступностиТоваров/ManagerModule.bsl
//	LNK 15.04.2019 10:25:54
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.МагазинОтправитель) = ТИП(Справочник.Склады)
	|			ТОГДА ДанныеДокумента.МагазинОтправитель.Магазин
	|		ИНАЧЕ ДанныеДокумента.МагазинОтправитель
	|	КОНЕЦ КАК МагазинОтправитель,
	|	ДанныеДокумента.МагазинПолучатель КАК МагазинПолучатель,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Резервировать
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Реквизиты = РезультатЗапроса.Выбрать();
	Реквизиты.Следующий();
	
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВПараметрыЗапроса(РезультатЗапроса, Реквизиты, Запрос);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	&МагазинОтправитель КАК Магазин,
	|	&Ссылка КАК Заказ,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Резервировать = ИСТИНА
	|	И НЕ ТаблицаТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.Магазин КАК Магазин,
	|	Товары.Заказ КАК Заказ,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Количество КАК Количество,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Количество = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Товары"
	;
	Результат = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаЗаказыПокупателей", Результат[1].Выгрузить());

КонецПроцедуры

Процедура СозданиеИзменениеЗапросовДоступности(ДокументСсылкаЗаказКлиента) Экспорт
	
	ДоставкаЗаНашСчет = (ДокументСсылкаЗаказКлиента.СуммаДоставки = 0);
	ДоставкаУчтена = Ложь;
	
	Если ДокументСсылкаЗаказКлиента.Статус = Перечисления.СтатусыЗаказовПокупателей.ЗапросДоступности
		Или ДокументСсылкаЗаказКлиента.Статус = Перечисления.СтатусыЗаказовПокупателей.Отменён Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПокупателяТовары.Ссылка КАК Ссылка,
			|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
			|	ЗаказПокупателяТовары.АкционнаяЦена КАК АкционнаяЦена,
			|	ЗаказПокупателяТовары.БонусАкцияНачислен КАК БонусАкцияНачислен,
			|	ЗаказПокупателяТовары.БонусАкцияСписан КАК БонусАкцияСписан,
			|	ЗаказПокупателяТовары.БонусБазаНачислен КАК БонусБазаНачислен,
			|	ЗаказПокупателяТовары.БонусБазаСписан КАК БонусБазаСписан,
			|	ЗаказПокупателяТовары.КлючСвязи КАК КлючСвязи,
			|	ЗаказПокупателяТовары.КлючСвязиБонусныхБаллов КАК КлючСвязиБонусныхБаллов,
			|	ЗаказПокупателяТовары.КодСтроки КАК КодСтроки,
			|	ЗаказПокупателяТовары.Количество КАК Количество,
			|	ЗаказПокупателяТовары.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
			|	ЗаказПокупателяТовары.Отменено КАК Отменено,
			|	ЗаказПокупателяТовары.ПричинаОтмены КАК ПричинаОтмены,
			|	ЗаказПокупателяТовары.Продавец КАК Продавец,
			|	ЗаказПокупателяТовары.ПродажаПодарка КАК ПродажаПодарка,
			|	ЗаказПокупателяТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
			|	ЗаказПокупателяТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
			|	ЗаказПокупателяТовары.Резервировать КАК Резервировать,
			|	ЗаказПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
			|	ЗаказПокупателяТовары.Сумма КАК Сумма,
			|	ЗаказПокупателяТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
			|	ЗаказПокупателяТовары.СуммаБонусныхБалловНачислено КАК СуммаБонусныхБалловНачислено,
			|	ЗаказПокупателяТовары.СуммаБонусныхБалловСписано КАК СуммаБонусныхБалловСписано,
			|	ЗаказПокупателяТовары.СуммаНДС КАК СуммаНДС,
			|	ЗаказПокупателяТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
			|	ЗаказПокупателяТовары.УникальныйИдентификатор КАК УникальныйИдентификатор,
			|	ЗаказПокупателяТовары.Упаковка КАК Упаковка,
			|	ЗаказПокупателяТовары.Характеристика КАК Характеристика,
			|	ЗаказПокупателяТовары.Цена КАК Цена,
			|	ЗаказПокупателяТовары.Склад КАК Склад,
			|	ЗаказПокупателяТовары.ТипДоставки КАК ТипДоставки,
			|	ВЫБОР
			|		КОГДА ЗаказПокупателяТовары.Самовывоз
			|			ТОГДА ЗаказПокупателяТовары.МагазинПолучатель
			|		ИНАЧЕ УчетнаяПолитикаСрезПоследних.ИнтернетМагазин
			|	КОНЕЦ КАК МагазинПолучатель,
			|	ЗаказПокупателяТовары.Самовывоз КАК Самовывоз,
			|	ЗаказПокупателяТовары.Ссылка.ОператорДоставки КАК ОператорДоставки,
			|	ЗаказПокупателяТовары.Ссылка.ДоставкаНаАдрес КАК ДоставкаНаАдрес,
			|	ВЫБОР
			|		КОГДА ЗаказПокупателяТовары.Склад.НазначениеСклада = ЗНАЧЕНИЕ(Перечисление.НазначенияСкладов.УправляющаяСистема)
			|			ТОГДА ЕСТЬNULL(ЗаказПокупателяТовары.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
			|		ИНАЧЕ ЕСТЬNULL(ЗаказПокупателяТовары.Склад.Магазин, ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка))
			|	КОНЕЦ КАК СкладМагазин,
			|	ЗаказПокупателяТовары.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности
			|ПОМЕСТИТЬ ТоварыЗП
			|ИЗ
			|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары,
			|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
			|ГДЕ
			|	ЗаказПокупателяТовары.Ссылка = &Ссылка
			|	И Не ЗаказПокупателяТовары.Отменено
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗапросДоступностиТоваровТовары.Ссылка КАК Ссылка,
			|	ЗапросДоступностиТоваровТовары.НомерСтроки КАК НомерСтроки,
			|	ЗапросДоступностиТоваровТовары.Количество КАК Количество,
			|	ЗапросДоступностиТоваровТовары.КоличествоТребование КАК КоличествоТребование,
			|	ЗапросДоступностиТоваровТовары.Номенклатура КАК Номенклатура,
			|	ЗапросДоступностиТоваровТовары.СтатусЗапроса КАК СтатусЗапроса,
			|	ЗапросДоступностиТоваровТовары.УникальныйИдентификатор КАК УникальныйИдентификатор,
			|	ЗапросДоступностиТоваровТовары.Характеристика КАК Характеристика,
			|	ЗапросДоступностиТоваровТовары.КлючСвязи КАК КлючСвязи,
			|	ЗапросДоступностиТоваровТовары.Ссылка.ОператорДоставки КАК ОператорДоставки,
			|	ЗапросДоступностиТоваровТовары.Ссылка.МагазинОтправитель КАК МагазинОтправитель,
			|	ЗапросДоступностиТоваровТовары.Ссылка.МагазинПолучатель КАК МагазинПолучатель
			|ПОМЕСТИТЬ ТоварыЗД
			|ИЗ
			|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
			|ГДЕ
			|	ЗапросДоступностиТоваровТовары.Ссылка.ДокументОснование = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыЗП.Ссылка КАК ТоварыЗПСсылка,
			|	ТоварыЗП.НомерСтроки КАК ТоварыЗПНомерСтроки,
			|	ТоварыЗП.АкционнаяЦена КАК ТоварыЗПАкционнаяЦена,
			|	ТоварыЗП.БонусАкцияНачислен КАК ТоварыЗПБонусАкцияНачислен,
			|	ТоварыЗП.БонусАкцияСписан КАК ТоварыЗПБонусАкцияСписан,
			|	ТоварыЗП.БонусБазаНачислен КАК ТоварыЗПБонусБазаНачислен,
			|	ТоварыЗП.БонусБазаСписан КАК ТоварыЗПБонусБазаСписан,
			|	ТоварыЗП.КлючСвязи КАК ТоварыЗПКлючСвязи,
			|	ТоварыЗП.КлючСвязиБонусныхБаллов КАК ТоварыЗПКлючСвязиБонусныхБаллов,
			|	ТоварыЗП.КодСтроки КАК ТоварыЗПКодСтроки,
			|	ТоварыЗП.Количество КАК ТоварыЗПКоличество,
			|	ТоварыЗП.КоличествоУпаковок КАК ТоварыЗПКоличествоУпаковок,
			|	ТоварыЗП.Номенклатура КАК ТоварыЗПНоменклатура,
			|	ТоварыЗП.Отменено КАК ТоварыЗПОтменено,
			|	ТоварыЗП.ПричинаОтмены КАК ТоварыЗППричинаОтмены,
			|	ТоварыЗП.Продавец КАК ТоварыЗППродавец,
			|	ТоварыЗП.ПродажаПодарка КАК ТоварыЗППродажаПодарка,
			|	ТоварыЗП.ПроцентАвтоматическойСкидки КАК ТоварыЗППроцентАвтоматическойСкидки,
			|	ТоварыЗП.ПроцентРучнойСкидки КАК ТоварыЗППроцентРучнойСкидки,
			|	ТоварыЗП.Резервировать КАК ТоварыЗПРезервировать,
			|	ТоварыЗП.СтавкаНДС КАК ТоварыЗПСтавкаНДС,
			|	ТоварыЗП.Сумма КАК ТоварыЗПСумма,
			|	ТоварыЗП.СуммаАвтоматическойСкидки КАК ТоварыЗПСуммаАвтоматическойСкидки,
			|	ТоварыЗП.СуммаБонусныхБалловНачислено КАК ТоварыЗПСуммаБонусныхБалловНачислено,
			|	ТоварыЗП.СуммаБонусныхБалловСписано КАК ТоварыЗПСуммаБонусныхБалловСписано,
			|	ТоварыЗП.СуммаНДС КАК ТоварыЗПСуммаНДС,
			|	ТоварыЗП.СуммаРучнойСкидки КАК ТоварыЗПСуммаРучнойСкидки,
			|	ТоварыЗП.УникальныйИдентификатор КАК ТоварыЗПУникальныйИдентификатор,
			|	ТоварыЗП.Упаковка КАК ТоварыЗПУпаковка,
			|	ТоварыЗП.Характеристика КАК ТоварыЗПХарактеристика,
			|	ТоварыЗП.Цена КАК ТоварыЗПЦена,
			|	ТоварыЗП.Склад КАК ТоварыЗПСклад,
			|	ТоварыЗП.ТипДоставки КАК ТоварыЗПТипДоставки,
			|	ТоварыЗП.МагазинПолучатель КАК ТоварыЗПМагазинПолучатель,
			|	ТоварыЗД.Ссылка КАК ТоварыЗДСсылка,
			|	ТоварыЗП.Самовывоз КАК ТоварыЗПСамовывоз,
			|	ТоварыЗП.ОператорДоставки КАК ТоварыЗПОператорДоставки,
			|	ТоварыЗП.ДоставкаНаАдрес КАК ТоварыЗПДоставкаНаАдрес,
			|	ТоварыЗД.ОператорДоставки КАК ТоварыЗДОператорДоставки,
			|	ТоварыЗП.КлючСвязиЗапросаДоступности КАК ТоварыЗПКлючСвязиЗапросаДоступности
			|ИЗ
			|	ТоварыЗП КАК ТоварыЗП
			|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыЗД КАК ТоварыЗД
			|		ПО ТоварыЗП.Ссылка = ТоварыЗД.Ссылка.ДокументОснование
			|		И ТоварыЗП.ОператорДоставки = ТоварыЗД.ОператорДоставки
			|		И ТоварыЗП.МагазинПолучатель = ТоварыЗД.Ссылка.МагазинПолучатель
			|		И ТоварыЗП.СкладМагазин = ТоварыЗД.Ссылка.МагазинОтправитель
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыЗДСсылка
			|ИТОГИ
			|ПО
			|	ТоварыЗДСсылка,
			|	ТоварыЗПСклад,
			|	ТоварыЗПОператорДоставки,
			|	ТоварыЗПМагазинПолучатель";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаТоварыЗДСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТоварыЗДСсылка.Следующий() Цикл
			
			Если ВыборкаТоварыЗДСсылка.ТоварыЗДСсылка = Null Тогда
				НовыйЗД = Истина; 
			Иначе 
				НовыйЗД = Ложь;
			КонецЕсли;
			
			ВыборкаТоварыЗПСклад = ВыборкаТоварыЗДСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТоварыЗПСклад.Следующий() Цикл 
				
				ВыборкаТоварыЗПОператорДоставки = ВыборкаТоварыЗПСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТоварыЗПОператорДоставки.Следующий() Цикл 
					
					ВыборкаТоварыЗПМагазинПолучатель = ВыборкаТоварыЗПОператорДоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
					
					Пока ВыборкаТоварыЗПМагазинПолучатель.Следующий() Цикл 
						
						Выборка = ВыборкаТоварыЗПМагазинПолучатель.Выбрать();
						ДокументСоздан = Ложь;
						ДокументИзменен = Ложь;
						КомментарийЗаказа = "";
						ПервыйКомментарий = Истина;
						
						Пока Выборка.Следующий() Цикл 
							
							Если Не ДокументСоздан Тогда 
								
								Если НовыйЗД Тогда  
									
									ДокументОбъект = Документы.ЗапросДоступностиТоваров.СоздатьДокумент();
									ДокументОбъект.Дата = ТекущаяДата();
									ДокументОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
									ДокументОбъект.ДокументОснование = ДокументСсылкаЗаказКлиента;
									Если Выборка.ТоварыЗПСклад.НазначениеСклада = Перечисления.НазначенияСкладов.УправляющаяСистема Тогда 
										ДокументОбъект.МагазинОтправитель = Выборка.ТоварыЗПСклад;
									Иначе
										ДокументОбъект.МагазинОтправитель = Выборка.ТоварыЗПСклад.Магазин;
									КонецЕсли;
									ДокументОбъект.МагазинПолучатель = Выборка.ТоварыЗПМагазинПолучатель;
									ДокументОбъект.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(,ДокументСсылкаЗаказКлиента.Ответственный);
									ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый;
									ДокументОбъект.ОператорДоставки = Выборка.ТоварыЗПОператорДоставки;
									ДокументОбъект.ТипДоставки = ВыборТипаДоставки(ДокументОбъект.ОператорДоставки, Выборка.ТоварыЗПДоставкаНаАдрес);  
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
										"ВЫБРАТЬ ПЕРВЫЕ 1
										|	ЗапросДоступностиТоваров.Номер КАК Номер
										|ИЗ
										|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
										|ГДЕ
										|	ЗапросДоступностиТоваров.ДокументОснование = &ДокументОснование
										|
										|УПОРЯДОЧИТЬ ПО
										|	Номер УБЫВ";
									
									Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказКлиента);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаНомер = РезультатЗапроса.Выбрать();
									
									Суффикс = "001";
									
									Если ВыборкаНомер.Следующий() Тогда
										Если Не СтрНайти(ВыборкаНомер.Номер,СокрЛП(ДокументСсылкаЗаказКлиента.Номер)) = 0 Тогда 
											Суффикс = Формат(Число(СтрЗаменить(ВыборкаНомер.Номер,СокрЛП(ДокументСсылкаЗаказКлиента.Номер) + "-", "") )+ 1, "ЧЦ=3; ЧВН=");
										КонецЕсли;
									КонецЕсли;
									
									ДокументОбъект.Номер = СокрЛП(ДокументСсылкаЗаказКлиента.Номер) + "-" + Суффикс;
									
								Иначе 
									
									ДокументОбъект = Выборка.ТоварыЗДСсылка.ПолучитьОбъект();
									
								КонецЕсли; 
								
								ДокументОбъект.ДокументОснованиеТекст = Строка(ДокументСсылкаЗаказКлиента);
								//Если Не Выборка.ТоварыЗПСсылка = Null И Выборка.ТоварыЗПСсылка.Статус = Перечисления.СтатусыЗаказовПокупателей.Отменён Тогда
								//	
								//	ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён;
								//	
								//КонецЕсли;
								//
								ДокументСоздан = Истина;
								ТЧТоварыЗД = ДокументОбъект.Товары.Выгрузить();
								ТЧТоварыЗД.Колонки.Добавить("Обработана");
								ТЧТоварыЗД.ЗаполнитьЗначения(Ложь, "Обработана");
								
							КонецЕсли;
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ ПЕРВЫЕ 1
								|	КомментарийПоСтрокам.Комментарий КАК Комментарий
								|ИЗ
								|	РегистрСведений.КомментарийПоСтрокам КАК КомментарийПоСтрокам
								|ГДЕ
								|	КомментарийПоСтрокам.Документ = &Документ
								|	И КомментарийПоСтрокам.КлючСвязи = &КлючСвязи";
							
							Запрос.УстановитьПараметр("Документ", ДокументСсылкаЗаказКлиента);
							Запрос.УстановитьПараметр("КлючСвязи", Выборка.ТоварыЗПКлючСвязиЗапросаДоступности);
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаКомментария = РезультатЗапроса.Выбрать();
							
							Если ВыборкаКомментария.Следующий() Тогда
								
								КомментарийЗаказа = КомментарийЗаказа
													+ ?(ПервыйКомментарий, "", ":")
													+ СокрЛП(Выборка.ТоварыЗПНоменклатура.Код)
													+ ":"
													+ СокрЛП(ВыборкаКомментария.Комментарий);
													
								ПервыйКомментарий = Ложь;
								
							КонецЕсли;
							
							Если НовыйЗД Тогда 
								
								ДобавлениеСтрокиЗД(Выборка, ТЧТоварыЗД);
								
							Иначе
								Если Не Выборка.ТоварыЗПКлючСвязиЗапросаДоступности = Null Тогда 
									
									НайденнаяСтрока = ТЧТоварыЗД.Найти(Выборка.ТоварыЗПКлючСвязиЗапросаДоступности, "КлючСвязи");
									
									Если НайденнаяСтрока = Неопределено Тогда
										
										ДобавлениеСтрокиЗД(Выборка, ТЧТоварыЗД);
										ДокументИзменен = Истина;
										
									Иначе
										
										НайденнаяСтрока.Обработана = Истина;
										
										Если Не НайденнаяСтрока.Сумма = Выборка.ТоварыЗПСумма Тогда 
											НайденнаяСтрока.Сумма = Выборка.ТоварыЗПСумма;
											ДокументИзменен = Истина;
										КонецЕсли;
										
										Если Не НайденнаяСтрока.СуммаНДС = Выборка.ТоварыЗПСуммаНДС Тогда 
											НайденнаяСтрока.СуммаНДС = Выборка.ТоварыЗПСуммаНДС;
											ДокументИзменен = Истина;
										КонецЕсли;

										Если НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён
												Или НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Отменён Тогда 
											
											НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Подготовить;
											НайденнаяСтрока.Количество = 0;
											НайденнаяСтрока.Примечание = "";
											ДокументИзменен = Истина;
											
										КонецЕсли;
										
										Если Выборка.ТоварыЗПОтменено И
												Не НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Отменён Тогда 
											
											НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Отменён;
											НайденнаяСтрока.Сумма = 0;
											НайденнаяСтрока.СуммаНДС = 0;
											ДокументИзменен = Истина;
											
										КонецЕсли;
										
										Если Не НайденнаяСтрока.КоличествоТребование = Выборка.ТоварыЗПКоличество Тогда
											
											НайденнаяСтрока.Примечание = НайденнаяСтрока.Примечание + Символы.ПС + "Изменено требуемое количество. Было - "
																			+ НайденнаяСтрока.КоличествоТребование + ". Стало - "
																			+ Выборка.ТоварыЗПКоличество + ".";
											//НайденнаяСтрока.Примечание = "";
											//НайденнаяСтрока.Количество = 0;
											НайденнаяСтрока.КоличествоТребование = Выборка.ТоварыЗПКоличество;
											НайденнаяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Изменён; 
											ДокументИзменен = Истина;
											
										КонецЕсли; 
									КонецЕсли; 
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла; 
						
						Для Каждого СтрокаТЧ Из ТЧТоварыЗД Цикл
							
							Если Не СтрокаТЧ.Обработана Тогда 
								
								Если Не СтрокаТЧ.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён Тогда
									
									ДокументИзменен = Истина;
									
								КонецЕсли;
								
								СтрокаТЧ.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён;
								СтрокаТЧ.Сумма = 0;
								СтрокаТЧ.СуммаНДС = 0; 
								
							КонецЕсли;   
							
						КонецЦикла;
						
						ДокументОбъект.Товары.Загрузить(ТЧТоварыЗД);
						
						ОтборУдаленныхСтрок = Новый Структура();
						ОтборУдаленныхСтрок.Вставить("СтатусЗапроса", Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён);  
						ДокументОтменён = Ложь;
						Если ТЧТоварыЗД.Количество() = ТЧТоварыЗД.НайтиСтроки(ОтборУдаленныхСтрок).Количество() Тогда
							
							Если Не ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён Тогда 
								
								ДокументИзменен = Истина;
								ДокументОтменён = Истина;
								
							КонецЕсли; 
							
						КонецЕсли;
						
						Если ДокументИзменен Тогда
							
							ДокументОбъект.СтатусЗапроса = ?(ДокументОтменён
																, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену
																, Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён);
							
						КонецЕсли;
															
						Если Не ДоставкаЗаНашСчет И Не ДоставкаУчтена Тогда
							Если Не ДокументОбъект.ТипДоставки = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз
									И Не ДокументОтменён Тогда
								ОплатаДоставки = Истина;
								ДоставкаУчтена = Истина;
							Иначе
								ОплатаДоставки = Ложь;
							КонецЕсли;
						Иначе
							ОплатаДоставки = Ложь;
						КонецЕсли;

						Если Не ДокументОбъект.ОплатаДоставки = ОплатаДоставки Тогда
							ДокументОбъект.ОплатаДоставки = ОплатаДоставки;
							ДокументИзменен = Истина;
						КонецЕсли;

						ДокументОбъект.Комментарий = КомментарийЗаказа;									
						
						Если Не ТЧТоварыЗД.Количество() = 0 И (ДокументИзменен Или НовыйЗД) Тогда 
							
							ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьСуммуВсегоВТаблице(ДокументОбъект.Товары, ДокументСсылкаЗаказКлиента.ЦенаВключаетНДС); 
							ОбработкаТабличнойЧастиТоварыКлиентСервер.ОбновитьСуммыПодвала(ДокументОбъект.Товары, ДокументСсылкаЗаказКлиента.ЦенаВключаетНДС, ДокументОбъект.СуммаДокумента);
							
						КонецЕсли;
						
						Если ДокументИзменен Или НовыйЗД Тогда
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеЗаписыватьКлючевыеАтрибуты");
							ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
	Если ДокументСсылкаЗаказКлиента.Статус = Перечисления.СтатусыЗаказовПокупателей.Перемещение 
			Или ДокументСсылкаЗаказКлиента.Статус = Перечисления.СтатусыЗаказовПокупателей.Доставка 
			Или ДокументСсылкаЗаказКлиента.Статус = Перечисления.СтатусыЗаказовПокупателей.Продажа Тогда 
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗапросДоступностиТоваров.Ссылка КАК Ссылка,
			|	ЗапросДоступностиТоваров.ТипДоставки КАК ТипДоставки,
			|	ЗапросДоступностиТоваров.МагазинОтправитель КАК МагазинОтправитель,
			|	ЗапросДоступностиТоваров.МагазинПолучатель КАК МагазинПолучатель
			|ИЗ
			|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
			|ГДЕ
			|	ЗапросДоступностиТоваров.ДокументОснование = &ДокументОснование
			|	И ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован)";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			
			Если Выборка.МагазинОтправитель = Выборка.МагазинПолучатель Тогда
				
				Если ДокументСсылкаЗаказКлиента.СтатусОплаты = Перечисления.СтатусОплаты.Оплачен Тогда
					
					ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал;
					
				Иначе 
					
					ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаНаКассе;   
					
				КонецЕсли; 
				
			Иначе 
				
				ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка; 
				
			КонецЕсли;   
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);  
			
		КонецЦикла; 
		
	КонецЕсли;  

КонецПроцедуры     

Процедура ДобавлениеСтрокиЗД(ВыборкаДляСтроки, ТЧ)
	
	Если Не ВыборкаДляСтроки.ТоварыЗПОтменено Тогда 
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.КоличествоТребование = ВыборкаДляСтроки.ТоварыЗПКоличество; 
		НоваяСтрока.Номенклатура = ВыборкаДляСтроки.ТоварыЗПНоменклатура; 
		НоваяСтрока.Характеристика = ВыборкаДляСтроки.ТоварыЗПХарактеристика;
		НоваяСтрока.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Подготовить; 
		НоваяСтрока.КлючСвязи = ВыборкаДляСтроки.ТоварыЗПКлючСвязиЗапросаДоступности; 
		НоваяСтрока.Сумма = ВыборкаДляСтроки.ТоварыЗПСумма; 
		НоваяСтрока.СуммаНДС = ВыборкаДляСтроки.ТоварыЗПСуммаНДС; 
		НоваяСтрока.Обработана = Истина; 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыборТипаДоставки(ОператорДоставки, ДоставкаНаАдрес)
	
	Результат = Перечисления.ТипДоставкиЗаказПокупателя.ПустаяСсылка();
	
	Если ОператорДоставки = Перечисления.ОператорыДоставки.ВнутренняяЛогистика Тогда
		
		Результат = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз; 
		
	ИначеЕсли ОператорДоставки = Перечисления.ОператорыДоставки.НоваяПочта Тогда 
		
		Результат = ?(ДоставкаНаАдрес,
						Перечисления.ТипДоставкиЗаказПокупателя.НоваяПочтаДоставкаПоАдресу,
						Перечисления.ТипДоставкиЗаказПокупателя.НоваяПочтаДоставкаВОтделение);
						
	ИначеЕсли ОператорДоставки = Перечисления.ОператорыДоставки.MeestExpress Тогда 
		
		Результат = ?(ДоставкаНаАдрес,
						Перечисления.ТипДоставкиЗаказПокупателя.MeestExpressДоставкаПоАдресу,
						Перечисления.ТипДоставкиЗаказПокупателя.MeestExpressДоставкаВОтделение);
						
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЛистОтбора") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЛистОтбора", 
			"Лист отбора", 
			ПечатьЛистаОтбора(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,,Истина);
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТоварнаяНакладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТоварнаяНакладная", 
			"Товарная накладная", 
			ПечатьТоварнаяНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует печатную форму документа.
//
Функция ПечатьЛистаОтбора(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
		
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;

	ТабличныйДокумент  = Новый ТабличныйДокумент;
	СинонимДокумента   = НСтр("ru='Лист отбора';uk='Аркуш відбору'", КодЯзыкаПечать);
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛистОтбора_ЛистОтбора"; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапросДоступностиТоваров.Ссылка КАК Ссылка,
	|	ЗапросДоступностиТоваров.Номер КАК НомерЗапроса,
	|	ЗапросДоступностиТоваров.Дата КАК ДатаЗапроса,
	|	ЗапросДоступностиТоваров.ТипДоставки КАК ТипДоставки,
	|	ЗапросДоступностиТоваров.ДокументОснование.Номер КАК Номер,
	|	ЗапросДоступностиТоваров.ДокументОснование.Дата КАК Дата
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
	|ГДЕ
	|	ЗапросДоступностиТоваров.Ссылка В (&МассивОбъектов)
	|	И ЗапросДоступностиТоваров.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросДоступностиТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ЗапросДоступностиТоваровТовары.Номенклатура КАК Номенклатура,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ЗапросДоступностиТоваровТовары.Количество КАК Количество,
	|	ЗапросДоступностиТоваровТовары.Ссылка КАК Ссылка,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Код КАК НоменклатураКод,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Марка КАК НоменклатураМарка,
	|	ЗапросДоступностиТоваровТовары.КоличествоТребование КАК КоличествоТребование
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
	|ГДЕ
	|	ЗапросДоступностиТоваровТовары.Ссылка В (&МассивОбъектов)
	|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
	|	И НЕ (ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён)
	|	ИЛИ ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Удалён))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";


	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.ЗапросДоступностиТоваров.ЛистОтбора", КодЯзыкаПечать);
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы 	= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ОбластьПодписей       = Макет.ПолучитьОбласть("Подписи");
	ОбластьИтого          = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогоНДС       = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	
	ВыборкаПоДокументам = Результаты[0].Выбрать();
	
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если НЕ ПервыйДокумент Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//ЗАГОЛОВОК
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = НСтр("ru='Лист отбора';uk='Аркуш відбору'", КодЯзыкаПечать);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//ШАПКА
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоДокументам);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		//СТРОКИ ТЧ
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьТоварнаяНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
		
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;

	ТабличныйДокумент  = Новый ТабличныйДокумент;
	СинонимДокумента   = НСтр("ru='Товарная накладная';uk='Товарна накладна'", КодЯзыкаПечать);
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТоварнаяНакладная_ТоварнаяНакладная"; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапросДоступностиТоваров.Ссылка КАК Ссылка,
	|	ЗапросДоступностиТоваров.Номер КАК НомерЗапроса,
	|	ЗапросДоступностиТоваров.Дата КАК ДатаЗапроса,
	|	ЗапросДоступностиТоваров.ТипДоставки КАК ТипДоставки,
	|	ЗапросДоступностиТоваров.ДокументОснование.Номер КАК Номер,
	|	ЗапросДоступностиТоваров.ДокументОснование.Дата КАК Дата,
	|	ЗапросДоступностиТоваров.ДокументОснование.Город КАК Город,
	|	ЗапросДоступностиТоваров.ДокументОснование.Улица КАК Улица,
	|	ЗапросДоступностиТоваров.ДокументОснование.Дом КАК Дом,
	|	ЗапросДоступностиТоваров.ДокументОснование.Квартира КАК Квартира,
	|	ЗапросДоступностиТоваров.ДокументОснование.Фамилия + "" "" + ЗапросДоступностиТоваров.ДокументОснование.Имя + "" "" +
	|		ЗапросДоступностиТоваров.ДокументОснование.Отчество КАК Получатель,
	|	МагазиныАдрес.Представление КАК АдресМагазина,
	|	ЗапросДоступностиТоваров.ДокументОснование.Контрагент КАК Клиент,
	|	ЗапросДоступностиТоваров.ДокументОснование.Телефон КАК Телефон,
	|	КонтрагентыПочта.Представление КАК ПочтаКлиента,
	|	КонтрагентыТелефон.Представление КАК ТелефонКлиента,
	|	0 КАК Доставка
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Магазины.КонтактнаяИнформация КАК МагазиныАдрес
	|		ПО ЗапросДоступностиТоваров.МагазинПолучатель = МагазиныАдрес.Ссылка
	|		И (МагазиныАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыТелефон
	|		ПО ЗапросДоступностиТоваров.ДокументОснование.Контрагент = КонтрагентыТелефон.Ссылка
	|		И (КонтрагентыТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыПочта
	|		ПО ЗапросДоступностиТоваров.ДокументОснование.Контрагент = КонтрагентыПочта.Ссылка
	|		И (КонтрагентыПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|ГДЕ
	|	ЗапросДоступностиТоваров.Ссылка В (&МассивОбъектов)
	|	И ЗапросДоступностиТоваров.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросДоступностиТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	ЗапросДоступностиТоваровТовары.Номенклатура КАК Номенклатура,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ЗапросДоступностиТоваровТовары.Количество КАК Количество,
	|	ЗапросДоступностиТоваровТовары.Ссылка КАК Ссылка,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Код КАК НоменклатураКод,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ЗапросДоступностиТоваровТовары.Номенклатура.Марка КАК НоменклатураМарка,
	|	ЗаказПокупателяТовары.Цена КАК Цена,
	|	ЗаказПокупателяТовары.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ЗапросДоступностиТоваровТовары.Ссылка.ДокументОснование = ЗаказПокупателяТовары.Ссылка
	|		И ЗапросДоступностиТоваровТовары.КлючСвязи = ЗаказПокупателяТовары.КлючСвязиЗапросаДоступности
	|		И НЕ ЗаказПокупателяТовары.Отменено
	|ГДЕ
	|	ЗапросДоступностиТоваровТовары.Ссылка В (&МассивОбъектов)
	|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";


	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Макет = УправлениеПечатью.ПолучитьМакет("Документ.ЗапросДоступностиТоваров.ТоварнаяНакладная", КодЯзыкаПечать);
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы 	= Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы");
	
	ОбластьПодписей       = Макет.ПолучитьОбласть("Подписи");
	ОбластьИтого          = Макет.ПолучитьОбласть("Итого");
	ОбластьИтогоНДС       = Макет.ПолучитьОбласть("ИтогоНДС");
	ОбластьСуммаПрописью  = Макет.ПолучитьОбласть("СуммаПрописью");
	
	ОбластьШапкаВозврата 			= Макет.ПолучитьОбласть("ШапкаВозврата");

	ВыборкаПоДокументам = Результаты[0].Выбрать();
	
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если НЕ ПервыйДокумент Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//ЗАГОЛОВОК
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//ШАПКА
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоДокументам);
		Если ВыборкаПоДокументам.ТипДоставки = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз Тогда 
			ОбластьШапка.Параметры.АдресДоставки = ВыборкаПоДокументам.АдресМагазина;
		Иначе 
			ОбластьШапка.Параметры.АдресДоставки = Строка(ВыборкаПоДокументам.Город)
													+ ", " + Строка(ВыборкаПоДокументам.Улица)
													+ ", " + Строка(ВыборкаПоДокументам.Дом)
													+ ", " + Строка(ВыборкаПоДокументам.Квартира);
		КонецЕсли;
		ОбластьШапка.Параметры.НазваниеТоварнойНакладной = 
				НСтр("ru='Товарная накладная №" + СокрЛП(ВыборкаПоДокументам.Номер) + "(" + СокрЛП(ВыборкаПоДокументам.НомерЗапроса) + ") от " + Формат(ВыборкаПоДокументам.Дата,"Л=ru; ДЛФ=DD") 
					+ "';uk='Товарна накладна №" + СокрЛП(ВыборкаПоДокументам.Номер) + "(" + СокрЛП(ВыборкаПоДокументам.НомерЗапроса) + ") вид " + Формат(ВыборкаПоДокументам.Дата,"Л=uk_UA; ДЛФ=DD") 
					+ "'", КодЯзыкаПечать);										
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		Итого = 0;
		//СТРОКИ ТЧ
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			Итого = Итого + ВыборкаПоСтрокамТЧ.Сумма;
			
			
		КонецЦикла;
		
		//ИТОГО
		ОбластьИтого.Параметры.Итого = Итого;
		ОбластьИтого.Параметры.Доставка = ВыборкаПоДокументам.Доставка;
		ОбластьИтого.Параметры.Всего = Итого + ВыборкаПоДокументам.Доставка; 
		
		ТабличныйДокумент.Вывести(ОбластьИтого);

		//СУММА ПРОПИСЬЮ
		
		СуммаКПрописи = Итого + ВыборкаПоДокументам.Доставка;
		ОбластьСуммаПрописью.Параметры.СуммаПрописью = ФормированиеПечатныхФормСервер.СформироватьСуммуПрописью(СуммаКПрописи, , КодЯзыкаПечать);
			
		ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);  

		//ПОДПИСИ
		ТабличныйДокумент.Вывести(ОбластьПодписей);
		
		//ШаблонДляВозврата
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//ШапкаВозврата
		ОбластьШапкаВозврата.Параметры.ЗаголовокВозврата = 
				НСтр("ru='По заказу №" + СокрЛП(ВыборкаПоДокументам.Номер) + "(" + СокрЛП(ВыборкаПоДокументам.НомерЗапроса) 
					+ "';uk='За замовленням №" + СокрЛП(ВыборкаПоДокументам.Номер) + "(" + СокрЛП(ВыборкаПоДокументам.НомерЗапроса) 
					+ "'", КодЯзыкаПечать);										
		ТабличныйДокумент.Вывести(ОбластьШапкаВозврата);
		

		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
